WcfHarness/WcfHarness/RequestXmls/CreateDirectory.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateDirectory xmlns="http://www.tavisca.com/Vexiere/IDirectory/2013/01">
      <createDirectoryRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:Directory>
          <a:AccessModifier>Public</a:AccessModifier>
          <a:DirectoryTypeId>1</a:DirectoryTypeId>
          <a:Id>0</a:Id>
          <a:IsDefault>false</a:IsDefault>
          <a:Name>2001a46b-454c-4822-8dac-27cca4a9463d</a:Name>
          <a:Settings xmlns:b="http://schemas.datacontract.org/2004/07/System.Collections.Generic"/>
        </a:Directory>
        <a:OwnerOrganizationIdentifier i:type="a:IdBasedOrganizationIdentifier">
          <a:Id>1</a:Id>
        </a:OwnerOrganizationIdentifier>
      </createDirectoryRequest>
    </CreateDirectory>
  </s:Body>
</s:Envelope>